zephyrproject-rtos/zephyr/drivers/disk/sdmmc_stm32.c
	}

	HAL_DMA_IRQHandler(hdma);
}

static int stm32_sdmmc_configure_dma(DMA_HandleTypeDef *handle, struct sdmmc_dma_stream *dma)
{
	int ret;
	struct dma_config hal_dma_cfg = dma->cfg;

	if (!device_is_ready(dma->dev)) {
		LOG_ERR("Failed to get dma dev");
		return -ENODEV;
	}

	dma->cfg.user_data = handle;

	/* Reserve the channel in the DMA subsystem, even though we use the HAL API.
	 * See the usage of STM32_DMA_HAL_OVERRIDE.
	 */
	ret = dma_config(dma->dev, dma->channel, &dma->cfg);
	if (ret != 0) {
		LOG_ERR("Failed to config");
		return ret;
	}

	hal_dma_cfg.channel_direction = PERIPHERAL_TO_MEMORY;
	hal_dma_cfg.source_data_size = 4U;
	hal_dma_cfg.dest_data_size = 4U;
	hal_dma_cfg.source_burst_length = 16U;
	hal_dma_cfg.dest_burst_length = 16U;
	ret = dma_stm32_zcfg_to_halcfg(dma->dev, &hal_dma_cfg, &handle->Init,
				       DMA_ADDR_ADJ_NO_CHANGE, DMA_ADDR_ADJ_INCREMENT);
	if (ret < 0) {
		return ret;
	}

	handle->Instance                 = STM32_DMA_GET_INSTANCE(dma->reg, dma->channel_nb);
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32_dma_v1)
	handle->Init.Channel             = dma->cfg.dma_slot * DMA_CHANNEL_1;
	handle->Init.Mode                = DMA_PFCTRL;
	handle->Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
	handle->Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
#else
	BUILD_ASSERT(STM32_SDMMC_USE_DMA_SHARED == 1, "Only txrx is supported on this family");
	/* handle->Init.Direction is not initialised here on purpose.
	 * Since the channel is reused for both directions, the direction is
	 * configured before each read/write call.
	 */
	handle->Init.Request             = dma->cfg.dma_slot;
#endif

	return ret;
}

static int stm32_sdmmc_dma_init(struct stm32_sdmmc_priv *priv)
{
	int err;

	LOG_DBG("using dma");

#if STM32_SDMMC_USE_DMA_SHARED
	err = stm32_sdmmc_configure_dma(&priv->dma_txrx_handle, &priv->dma_txrx);
	if (err) {
		LOG_ERR("failed to init shared DMA");
		return err;
	}
	__HAL_LINKDMA(&priv->hsd, hdmatx, priv->dma_txrx_handle);
	__HAL_LINKDMA(&priv->hsd, hdmarx, priv->dma_txrx_handle);
#else
	err = stm32_sdmmc_configure_dma(&priv->dma_tx_handle, &priv->dma_tx);
	if (err) {
		LOG_ERR("failed to init tx dma");
		return err;
	}
	__HAL_LINKDMA(&priv->hsd, hdmatx, priv->dma_tx_handle);
	if (HAL_DMA_Init(&priv->dma_tx_handle) != HAL_OK) {
		return -EIO;
	}

	err = stm32_sdmmc_configure_dma(&priv->dma_rx_handle, &priv->dma_rx);
	if (err) {
		LOG_ERR("failed to init rx dma");
		return err;
	}
	__HAL_LINKDMA(&priv->hsd, hdmarx, priv->dma_rx_handle);
	if (HAL_DMA_Init(&priv->dma_rx_handle) != HAL_OK) {
		return -EIO;
	}
#endif /* STM32_SDMMC_USE_DMA_SHARED */

	return err;
}

static int stm32_sdmmc_dma_deinit(struct stm32_sdmmc_priv *priv)
{
	int ret;

	/* Since we use STM32_DMA_HAL_OVERRIDE, the only purpose of dma_stop
	 * is to notify the DMA subsystem that the channel is no longer in use.
	 * Calling this before or after HAL_DMA_DeInit makes no difference.
	 * There is no possibility of runtime failures apart from providing an
	 * invalid channel ID, which is already validated by the setup.
	 */
#if STM32_SDMMC_USE_DMA_SHARED
	struct sdmmc_dma_stream *dma_txrx = &priv->dma_txrx;

	ret = dma_stop(dma_txrx->dev, dma_txrx->channel);
	__ASSERT(ret == 0, "Shared DMA channel index corrupted");
#else
	struct sdmmc_dma_stream *dma_tx = &priv->dma_tx;
	struct sdmmc_dma_stream *dma_rx = &priv->dma_rx;
	HAL_StatusTypeDef __maybe_unused hal_ret;

	ret = dma_stop(dma_tx->dev, dma_tx->channel);
	__ASSERT(ret == 0, "TX DMA channel index corrupted");
	hal_ret = HAL_DMA_DeInit(&priv->dma_tx_handle);
	__ASSERT_NO_MSG(hal_ret == HAL_OK);

	ret = dma_stop(dma_rx->dev, dma_rx->channel);
	__ASSERT(ret == 0, "RX DMA channel index corrupted");
	hal_ret = HAL_DMA_DeInit(&priv->dma_rx_handle);
	__ASSERT_NO_MSG(hal_ret == HAL_OK);
#endif
	return 0;
}

#endif

/* Forward declarations */
static int stm32_sdmmc_pwr_on(struct stm32_sdmmc_priv *priv);
static void stm32_sdmmc_pwr_off(struct stm32_sdmmc_priv *priv);

#if !defined(CONFIG_SDMMC_STM32_EMMC)
static int stm32_sdmmc_card_detect_init(struct stm32_sdmmc_priv *priv);
static int stm32_sdmmc_card_detect_uninit(struct stm32_sdmmc_priv *priv);
#endif /* !CONFIG_SDMMC_STM32_EMMC */

static bool stm32_sdmmc_card_present(struct stm32_sdmmc_priv *priv);

static int stm32_sdmmc_access_init(struct disk_info *disk)
{
	const struct device *dev = disk->dev;
	struct stm32_sdmmc_priv *priv = dev->data;
	HAL_StatusTypeDef hal_ret;
	int err;

	err = stm32_sdmmc_pwr_on(priv);
	if (err) {
		return -EIO;
	}

	/* Configure dt provided device signals when available */
	err = pinctrl_apply_state(priv->pcfg, PINCTRL_STATE_DEFAULT);
	if (err < 0) {
		stm32_sdmmc_pwr_off(priv);
		return err;
	}

#if !defined(CONFIG_SDMMC_STM32_EMMC)
	err = stm32_sdmmc_card_detect_init(priv);
	if (err) {
		stm32_sdmmc_pwr_off(priv);
		return err;
	}
#endif

	if (!stm32_sdmmc_card_present(priv)) {
		priv->status = DISK_STATUS_NOMEDIA;
		err = -ENODEV;
		goto error;
	}

	priv->status = DISK_STATUS_UNINIT;

#if STM32_SDMMC_USE_DMA
	err = stm32_sdmmc_dma_init(priv);
	if (err) {
		LOG_ERR("DMA init failed");
		goto error;
	}
#endif

	err = stm32_sdmmc_clock_enable(priv);
	if (err) {
		LOG_ERR("failed to init clocks");
		goto error;
	}

	err = reset_line_toggle_dt(&priv->reset);
	if (err) {
		LOG_ERR("failed to reset peripheral");
		goto error;
	}

#ifdef CONFIG_SDMMC_STM32_EMMC
	hal_ret = HAL_MMC_Init(&priv->hsd);
#else
	hal_ret = HAL_SD_Init(&priv->hsd);
#endif
	if (hal_ret != HAL_OK) {
		LOG_ERR("failed to init stm32_sdmmc (ErrorCode 0x%X)", priv->hsd.ErrorCode);
		err = -EIO;
		goto error;
	}

	if (SDMMC_BUS_WIDTH != SDMMC_BUS_WIDE_1B) {
		priv->hsd.Init.BusWide = SDMMC_BUS_WIDTH;
#ifdef CONFIG_SDMMC_STM32_EMMC
		hal_ret = HAL_MMC_ConfigWideBusOperation(&priv->hsd, priv->hsd.Init.BusWide);
#else
		hal_ret = HAL_SD_ConfigWideBusOperation(&priv->hsd, priv->hsd.Init.BusWide);
#endif
		if (hal_ret != HAL_OK) {
			LOG_ERR("failed to configure wide bus operation (ErrorCode 0x%X)",
				priv->hsd.ErrorCode);
			err = -EIO;
			goto error;
		}
	}

#ifdef CONFIG_SDMMC_STM32_HWFC
	stm32_sdmmc_fc_enable(priv);
#endif

	priv->status = DISK_STATUS_OK;
	return 0;
error:
#if !defined(CONFIG_SDMMC_STM32_EMMC)
	stm32_sdmmc_card_detect_uninit(priv);
#endif /* !CONFIG_SDMMC_STM32_EMMC */
	stm32_sdmmc_pwr_off(priv);
	return err;
}

static int stm32_sdmmc_access_deinit(struct stm32_sdmmc_priv *priv)
{
	HAL_StatusTypeDef hal_ret;

#if STM32_SDMMC_USE_DMA
	int err;

	err = stm32_sdmmc_dma_deinit(priv);
	if (err) {
		LOG_ERR("DMA deinit failed");
		return err;
	}
#endif

#if defined(CONFIG_SDMMC_STM32_EMMC)
	hal_ret = HAL_MMC_DeInit(&priv->hsd);
#else
	hal_ret = HAL_SD_DeInit(&priv->hsd);
	stm32_sdmmc_clock_disable(priv);
#endif
	if (hal_ret != HAL_OK) {
		LOG_ERR("failed to deinit stm32_sdmmc (ErrorCode 0x%X)", priv->hsd.ErrorCode);
		return -EIO;
	}

#if !defined(CONFIG_SDMMC_STM32_EMMC)
	stm32_sdmmc_card_detect_uninit(priv);
#endif
	stm32_sdmmc_pwr_off(priv);

	priv->status = DISK_STATUS_UNINIT;
	return 0;
}

