zephyrproject-rtos/zephyr/drivers/disk/sdmmc_stm32.c
	err = gpio_pin_interrupt_configure_dt(&priv->cd, GPIO_INT_EDGE_BOTH);
	if (err) {
		goto unconfigure_pin;
	}
	return 0;

unconfigure_pin:
	gpio_pin_configure_dt(&priv->cd, GPIO_DISCONNECTED);
remove_callback:
	gpio_remove_callback(priv->cd.port, &priv->cd_cb);
	return err;
}

static int stm32_sdmmc_card_detect_uninit(struct stm32_sdmmc_priv *priv)
{
	if (!priv->cd.port) {
		return 0;
	}

	gpio_pin_interrupt_configure_dt(&priv->cd, GPIO_INT_MODE_DISABLED);
	gpio_pin_configure_dt(&priv->cd, GPIO_DISCONNECTED);
	gpio_remove_callback(priv->cd.port, &priv->cd_cb);
	return 0;
}
#endif /* !CONFIG_SDMMC_STM32_EMMC */

static int stm32_sdmmc_pwr_on(struct stm32_sdmmc_priv *priv)
{
	int err;

	if (!priv->pe.port) {
		return 0;
	}

	if (!gpio_is_ready_dt(&priv->pe)) {
		return -ENODEV;
	}

	err = gpio_pin_configure_dt(&priv->pe, GPIO_OUTPUT_ACTIVE);
	if (err) {
		return err;
	}

	k_sleep(K_MSEC(50));

	return 0;
}

static void stm32_sdmmc_pwr_off(struct stm32_sdmmc_priv *priv)
{
	int ret;

	if (!priv->pe.port) {
		return;
	}

	/* PINCTRL sleep mode when powered down */
	ret = pinctrl_apply_state(priv->pcfg, PINCTRL_STATE_SLEEP);
	if (ret != 0 && ret != ENOTSUP) {
		LOG_WRN("Failed to configure pins for sleep (%d)", ret);
	}
	gpio_pin_configure_dt(&priv->pe, GPIO_OUTPUT_INACTIVE);
}

static int disk_stm32_sdmmc_init(const struct device *dev)
{
	struct stm32_sdmmc_priv *priv = dev->data;

	if (!device_is_ready(priv->reset.dev)) {
		LOG_ERR("reset control device not ready");
		return -ENODEV;
	}

	priv->irq_config(dev);

	/* Initialize semaphores */
	k_sem_init(&priv->thread_lock, 1, 1);
	k_sem_init(&priv->sync, 0, 1);

#if !defined(CONFIG_SDMMC_STM32_EMMC)
	k_work_init(&priv->work, stm32_sdmmc_cd_handler);
#endif

	/* Ensure off by default */
	stm32_sdmmc_pwr_off(priv);

	stm32_sdmmc_info.dev = dev;
	return disk_access_register(&stm32_sdmmc_info);
}

void stm32_sdmmc_get_card_cid(const struct device *dev, uint32_t cid[4])
{
	const struct stm32_sdmmc_priv *priv = dev->data;

	memcpy(cid, &priv->hsd.CID, sizeof(priv->hsd.CID));
}

void stm32_sdmmc_get_card_csd(const struct device *dev, uint32_t csd[4])
{
	const struct stm32_sdmmc_priv *priv = dev->data;

	memcpy(csd, &priv->hsd.CSD, sizeof(priv->hsd.CSD));
}

#if DT_NODE_HAS_STATUS_OKAY(DT_DRV_INST(0))

#if STM32_SDMMC_USE_DMA

#define SDMMC_DMA_CHANNEL_INIT(dir, dir_cap)				\
	.dev = DEVICE_DT_GET(STM32_DT_INST_DMA_CTLR(0, dir)),		\
	.channel = DT_INST_DMAS_CELL_BY_NAME(0, dir, channel),		\
	.channel_nb = DT_DMAS_CELL_BY_NAME(				\
			DT_DRV_INST(0), dir, channel),			\
	.reg = (DMA_TypeDef *)DT_REG_ADDR(				\
			DT_PHANDLE_BY_NAME(DT_DRV_INST(0), dmas, dir)),	\
	.cfg = {							\
		.dma_slot = STM32_DT_INST_DMA_SLOT(0, dir),		\
		.channel_priority = STM32_DMA_CONFIG_PRIORITY(		\
			STM32_DT_INST_DMA_CHANNEL_CONFIG(0, dir)),	\
		.dma_callback = stm32_sdmmc_dma_cb,			\
		.linked_channel = STM32_DMA_HAL_OVERRIDE,		\
	},

#define SDMMC_DMA_CHANNEL(dir, DIR)					\
	.dma_##dir = {							\
		COND_CODE_1(DT_INST_DMAS_HAS_NAME(0, dir),		\
			    (SDMMC_DMA_CHANNEL_INIT(dir, DIR)),		\
			    (NULL))					\
	},

#else /* STM32_SDMMC_USE_DMA */
#define SDMMC_DMA_CHANNEL(dir, DIR)
#endif /* STM32_SDMMC_USE_DMA */

PINCTRL_DT_INST_DEFINE(0);

static void stm32_sdmmc_irq_config_func(const struct device *dev)
{
	IRQ_CONNECT(DT_INST_IRQN(0),
		DT_INST_IRQ(0, priority),
		stm32_sdmmc_isr, DEVICE_DT_INST_GET(0),
		0);
	irq_enable(DT_INST_IRQN(0));
}

static struct stm32_pclken pclken_sdmmc[] = STM32_DT_INST_CLOCKS(0);

static struct stm32_sdmmc_priv stm32_sdmmc_priv_1 = {
	.irq_config = stm32_sdmmc_irq_config_func,
	.hsd = {
		.Instance = (MMC_TypeDef *)DT_INST_REG_ADDR(0),
		.Init.ClockEdge = SDMMC_CLOCK_EDGE_RISING,
#ifdef SDIO_CLOCK_BYPASS_DISABLE
		.Init.ClockBypass = DT_INST_PROP(0, clk_bypass)
						? SDIO_CLOCK_BYPASS_ENABLE
						: SDIO_CLOCK_BYPASS_DISABLE,
#elif defined(SDMMC_CLOCK_BYPASS_DISABLE)
		.Init.ClockBypass = DT_INST_PROP(0, clk_bypass)
						? SDMMC_CLOCK_BYPASS_ENABLE
						: SDMMC_CLOCK_BYPASS_DISABLE,
#endif
		.Init.ClockPowerSave = SDMMC_CLOCK_POWER_SAVE_DISABLE,
		.Init.BusWide = SDMMC_BUS_WIDE_1B,
		.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE,
		.Init.ClockDiv = DT_INST_PROP_OR(0, clk_div, 0),
	},
#if DT_INST_NODE_HAS_PROP(0, cd_gpios)
	.cd = GPIO_DT_SPEC_INST_GET(0, cd_gpios),
#endif
#if DT_INST_NODE_HAS_PROP(0, pwr_gpios)
	.pe = GPIO_DT_SPEC_INST_GET(0, pwr_gpios),
#endif
	.pclken = pclken_sdmmc,
	.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(0),
	.reset = RESET_DT_SPEC_INST_GET(0),
#if STM32_SDMMC_USE_DMA_SHARED
	SDMMC_DMA_CHANNEL(txrx, TXRX)
#else
	SDMMC_DMA_CHANNEL(rx, RX)
	SDMMC_DMA_CHANNEL(tx, TX)
#endif
};

DEVICE_DT_INST_DEFINE(0, disk_stm32_sdmmc_init, NULL,
		    &stm32_sdmmc_priv_1, NULL, POST_KERNEL,
		    CONFIG_SD_INIT_PRIORITY,
		    NULL);
#endif
